zuogong = {
    "三阳制阴": "具备强烈的正义感与责任心，情怀丰富，文才出众。坚持不懈，能有始有终。历史上许多知名人物均属此类。若命中运势佳，可成就一番伟业。适宜行木火阳运，事业发展吉祥。",
    "三阴制阳": "深谙社会及自然规律，思维灵活，执行力强，历史上不乏此类杰出人物。运势配合，可开创大业。适宜行金水阴运，事业前景光明。",
    "阳制阴": "人文关怀丰富，阳光乐观。运势良好时，可取得显著成就。适宜行木火阳运，事业发展顺利。",
    "阴制阳": "对规则和人性有深刻理解。运势良好时，可实现卓越成绩。适宜行金水阴运，事业有成。",
    "贼捕阳制阴": "行动力强，需掌握适度原则，避免过犹不及。适宜行阴运，事业运势吉祥。",
    "贼捕阴制阳": "具有强执行力，重在掌握分寸，恰到好处。适宜行阴运，事业顺利。",
    "金水阴一气": "洞察力强，适宜行金水阴运，事业发展良好。行木火阳运则不利。",
    "木火阳一气": "文采飞扬，记忆力强，适宜行木火阳运，事业吉祥。行金水阴运则凶险。",
    "印化官杀": "天生具有管理能力和声望，适合担任领导角色。适宜各种行运，不拘一格。",
    "食伤生财": "技术娴熟或商业头脑灵活，聪明勤奋，努力即有回报。各种行运均适宜，无忌讳。",
    "入墓做功": "能调动巨大力量，具有集团领导潜质。官杀库指政府或事业单位，印枭库指学校或文化机构，比劫库指军警，食伤库指娱乐集团等。",
    "年时贯通": "能量强大，时间和空间维度的调动能力强，预示着能够承担重大使命和责任。"
}

rich_summary = {
    "大凶": "重大障碍与失望似乎无处不在，梦想与现实之间的鸿沟愈发明显。此时，更应回归易学之本质，即在动荡不安中寻求平衡与和谐。培养坚韧不拔的心态和积极向上的精神，是应对生活考验、转化逆境为顺境的关键。面对挑战，应以静制动，不被外界纷扰所动摇。内心的平静与坚定，是克服困难的坚实基石。日常之中，不断自我提升，无论是精神层面还是技能层面，都是构筑成功基础的重要途径.",
    "凶": "遭遇凶象，屡受挫折，财路艰难，损失难免，面对长期目标时感到挑战重重。然而，易学教导我们，世间万物皆有阴阳，逆境亦是成长与转变的契机。是以，在这样的时期，更需以坚定的信念，持之以恒的心态，对待每一次的挑战与不易。易经云：“否极泰来”，在最为困难的时刻，也隐藏着转机的种子。因此，在面对困境时，宜调整心态，将注意力集中于能控制的因素上——即自我提升和日常的小胜。通过积极的行动和不懈的努力，可以逐步转化逆境为顺境，最终达到内在和外在的和谐统一。",
    "平": "财务与事业之路，宜遵天道、顺人心。在通往成就之旅中，金钱虽为必需，然而不易之获亦是自然循环之常态。是故，节俭之德显尤为重要，它不仅是对财富的尊重，亦是达成长远目标的基石。于个人之雄图大志，更需融汇现实之酌量，将脚踏实地作为立身之本。在此征途上，逐步前行，持续自我提升，心理与身体的双重锻炼，乃攀登高峰之要诀。心志坚定，方能于变幻莫测的世界中保持不移，身体健全，方可支撑远大理想之实现。故此，智者之道，在于穷理尽性，以身作则，以德服人。在物质与精神之间找到平衡，不仅追求个人的成功和财富积累，更要注重社会责任与影响力的体现。只有这样，成功才具有深远的意义，人生旅途才显充实而有价值。",
    "吉": "当前阶段，您正处于一个极为有利的周期，天赋的吉星照耀，预示着在财富和事业方面将迎来显著的好运和发展机遇。数值25象征着稳健的进步和可观的成果，这一时期您将发现自己周围充满了促进成长和成功的条件。\n识别并把握机遇：关键在于敏锐地识别出这些机遇，并在适当的时刻以恰当的方式把握它们。保持对市场动态和行业趋势的高度敏感，能够让您在众多机会中精准锁定那些最有利于您的成长和进步的。\n指向成长和潜力的努力：将您的努力聚焦于那些能够最大化您的成长潜力的领域。无论是个人技能的提升，还是事业上的战略规划，都应该围绕如何能够更好地实现自我超越和目标达成来进行。\n指向成长和潜力的努力：将您的努力聚焦于那些能够最大化您的成长潜力的领域。无论是个人技能的提升，还是事业上的战略规划，都应该围绕如何能够更好地实现自我超越和目标达成来进行。\n建立和执行计划：拥有一个清晰的计划，以及为实现这个计划而制定的战略和行动步骤，将是成功的关键。计划应包括短期目标和长期愿景，以及为达到这些目标所需采取的具体行动。\n持续学习和自我提升：在追求财富和事业成功的过程中，持续的学习和自我提升是不可或缺的。不断地扩展您的知识库和技能集，将使您保持竞争力，并能够更好地适应不断变化的环境。\n积极心态与韧性：保持积极的心态，面对挑战时不轻言放弃，韧性和决心是克服困难、实现目标的重要支柱。\n总之，这是一个充满希望和机遇的时期。通过积极主动地行动，您将能够充分利用这一周期的有利条件，实现财富增长和事业发展的目标。记住，每一步的进展都是向着您梦想的阶梯，坚定不移地走下去，成功就在眼前。",
    "大吉": "财事途中，前景光明，机遇如云，大成在望。在这一路的追求与奋斗中，天赋的光芒与时机的成熟交织成一幅幅胜利的画卷。宜明智识变，以适时之势，促己之进。不仅仅是为了个人的成长与成功，更是为了担当起对社会的责任，使个人的成就转化为社会的财富，影响力远播。在探索财富与事业的深渊时，宜以宽广的胸怀去思考，如何将个人潜能的发挥，与社会责任的承担紧密相连。让每一步的进展，不仅仅是个人成功的足迹，更是对社会的贡献与启迪。这样的成功，才是真正有意义、有价值的成功。易经云：‘天行健，君子以自强不息。地势坤，君子以厚德载物。’在自我提升的同时，也要不忘回馈社会，用自己的力量去启发与帮助他人，共创和谐繁荣的世界。"
}


rich_yun = {
    "大凶": "这个大运是人生低潮的低潮，即使碰到好事也难以显著改善，坏事情可能会加倍恶化。应小心谨慎，避免冲动行事，是学习、锻炼和从挫折中成长的好时机。",
    "凶": "这个大运是人生的低潮期，即便遇到好事也不会太好，坏事可能会恶化。需要小心谨慎，避免冲动，适宜的行动包括学习、锻炼以及从经历中寻找成长的机会。",
    "平": "这个大运代表人生的正常周期，既不会有太大的起伏，也不会有太大的挑战。是稳定发展、积累经验和能力的阶段。",
    "吉": "这个大运是人生中的良好时期，会有不错的机遇出现。应当把握机会，积极行动，以实现个人目标和梦想。",
    "大吉": "这个大运是人生中的黄金时期，机遇多，成就易得。建议充分利用这一时期的有利条件，追求更高的目标和成就，同时也不忘回馈社会，做出有意义的社会贡献。"
}


rich_year = {
    "大凶": "这一年可能是充满挑战的一年，可能会遇到比平常更多的困难和阻碍。建议保持冷静，避免冲动决策。是反思、学习和内在成长的重要时期，通过锻炼和学习提升自己，为未来铺路。",
    "凶": "这一年可能会面临一些挑战和不顺，但通过谨慎行事和持续的个人发展，可以减少负面影响。专注于自我提升，如学习新技能或加强身心健康，为转运做准备。",
    "平": "这一年的运势相对平稳，没有太大的起伏。应利用这一稳定期进行长期规划和能力积累。保持耐心和持续的努力，为未来的机遇做好准备。",
    "吉": "这一年将会带来不少好机会和顺利的进展，但仍需主动出击才能抓住这些机遇。保持积极主动，利用好运来实现个人目标和提升。关注新机遇，不畏惧挑战。",
    "大吉": "这一年是极为吉利和充满机会的一年，应充分利用这段时期的优势，大胆追求梦想和目标。同时，也是扩大影响力和做出社会贡献的好时机，不仅为自己，也为他人带来积极的变化。"
}


rich_month = {
    "1月": {
        "大凶": "需要特别小心处理个人和财务问题，避免冲动和不必要的风险。",
        "凶": "可能面临一些小挑战，保持耐心，通过冷静思考来解决问题。",
        "平": "一切顺其自然，维持现状，适合规划和积累。",
        "吉": "新的一年开启新机遇，积极行动将带来好运。",
        "大吉": "非常顺利的一个月，适合实施大胆计划和扩展业务。"
    },
    "2月": {
        "大凶": "面临重大挑战，可能需要重新评估方向和策略。",
        "凶": "小心应对可能出现的困难，不要轻易放弃。",
        "平": "稳定的一个月，保持平衡，避免做出重大决策。",
        "吉": "机遇和挑战并存，抓住机遇可以带来进步。",
        "大吉": "极好的发展机会，适合扩张和投资。"
    },
    "3月": {
        "大凶": "这个月需特别警惕，可能会有不可预见的困难或挑战出现。",
        "凶": "挑战依旧，但通过努力，可以减轻一些负面影响。",
        "平": "事情发展较为平稳，是深思熟虑未来计划的好时机。",
        "吉": "开始显现积极的转变，利用这股势头推进个人目标。",
        "大吉": "春天带来新生，是行动和实现梦想的绝佳时机。"
    },
    "4月": {
        "大凶": "可能面临一些严峻的试炼，需要格外小心。",
        "凶": "尽管有些挑战，但是通过坚持不懈，可以看到一些进步。",
        "平": "保持现状，稳定发展。是规划长期目标的好时期。",
        "吉": "事业和个人生活都有所进步，保持这种势头。",
        "大吉": "显著的好运，适合扩大投资和探索新机会。"
    },
    "5月": {
        "大凶": "需面对可能的挑战，保持冷静，寻求解决方案。",
        "凶": "虽有波折，但也是成长和学习的机会。",
        "平": "相对平静的月份，保持耐心，继续努力。",
        "吉": "积极的趋势开始显现，抓住任何可能的机会。",
        "大吉": "极佳的发展机遇，可能会有重大的突破。"
    },
    "6月": {
        "大凶": "可能遇到重大的障碍，需要谨慎行事。",
        "凶": "持续的挑战可能会影响士气，但不要失去希望。",
        "平": "稳定的月份，适合总结经验教训，准备下一步行动。",
        "吉": "将看到之前努力的成果，继续保持积极态度。",
        "大吉": "好运在视线中，可能实现重要的职业或个人目标。"
    },
    "7月": {
        "大凶": "面对挑战时需保持坚韧不拔，避免决策失误。",
        "凶": "小的波折可能出现，但也有克服困难的机会。",
        "平": "事务平稳，是检视计划并做出微调的好时机。",
        "吉": "积极发展的迹象，应把握机会，积极前行。",
        "大吉": "极好的一月，适合大胆追求目标，可能会收获意想不到的成功。"
    },
    "8月": {
        "大凶": "可能是挑战重重的一个月，需保持耐性和韧性。",
        "凶": "可能会有一些障碍，但通过坚持可以看到曙光。",
        "平": "稳定是这个月的主题，不宜做出大的改变。",
        "吉": "适合实施计划和开展新项目，保持积极进取。",
        "大吉": "可能迎来一波好运，是实现梦想的好时机。"
    },
    "9月": {
        "大凶": "挑战可能让人感到压力山大，但也是成长的机会。",
        "凶": "逆境中寻找学习的机会，保持决心，可逐渐看到希望。",
        "平": "保持现状，是思考未来方向的好时机。",
        "吉": "秋天的收获期，是付出努力得到回报的时候。",
        "大吉": "可能实现一些重要的突破，是非常顺利的一个月。"
    },
    "10月": {
        "大凶": "要小心应对可能的困难，保持耐心和谨慎。",
        "凶": "挑战依然存在，但不要放弃，继续寻求解决方案。",
        "平": "平静的月份，适合规划未来，准备新的开始。",
        "吉": "开始看到积极的结果，继续保持这一势头。",
        "大吉": "一个充满机遇的月份，是时候扩展视野，追求更大的目标了。"
    },
    "11月": {
        "大凶": "可能遇到一些严重的挑战，需要格外的努力和坚持。",
        "凶": "即使面临挑战，也有机会从中学习和成长。",
        "平": "一切顺其自然，是个不错的时间点来为年末做准备。",
        "吉": "积极的势头继续，可以期待一些好消息。",
        "大吉": "在年末之前，可能会有一些显著的进步和成功，利用这股势头为来年铺好道路。"
    },

    "12月": {
        "大凶": "年末可能遇到意料之外的挑战，保持冷静，避免决策失误。",
        "凶": "可能感到压力增大，注意调节心态，避免过度焦虑。",
        "平": "平稳收尾，总结一年的得失，为新的一年做准备。",
        "吉": "好运连连，适合完成年度目标，收获成果。",
        "大吉": "一年中最好的结束，高潮迭起，可能有意外惊喜。"
    }
}


rich_day = {
    "大凶": "今天可能面临许多挑战和困难，重要的是保持冷静，避免做出冲动的决定。尽量保持低调，避免重要的决策或投资。",
    "凶": "今天可能遇到一些小挫折，不要气馁。适合进行内省和计划调整，避免进行重要的商业活动或决策。",
    "平": "今天的运势平稳，没有太大的起伏。维持日常的工作和生活节奏，避免进行风险较高的活动。",
    "吉": "今天是积极向上的一天，适合推进计划和项目。可以考虑进行一些重要的决策或投资，但仍需谨慎。",
    "大吉": "今天的运势非常好，是采取行动的最佳时机。可以大胆前行，追求目标。适合进行重要的商业决策和投资。"
}

rich_hour = {
    "子时 (1-3点)": {
        "大凶": "可能遇到意外困难，避免深夜重要决策。",
        "凶": "需谨慎行事，避免夜间活动。",
        "平": "维持现状，适合休息与反思。",
        "吉": "静夜思考带来新灵感。",
        "大吉": "适合筹划，夜深人静心思清明。"
    },
    "丑时 (3-5点)": {
        "大凶": "保持警觉，避免此时做出重大决定。",
        "凶": "注意健康，可能因失眠或疲劳感到不适。",
        "平": "一切平静，是自我修养的好时机。",
        "吉": "清晨的冥想将带来平静与启示。",
        "大吉": "黎明前的暗示，启动重要计划的好时刻。"
    },
    "寅时 (5-7点)": {
        "大凶": "小心意外，可能遇到早晨的挑战。",
        "凶": "启动一天的准备，可能遇到小阻碍。",
        "平": "日出而作，是开始日常工作的平稳时刻。",
        "吉": "新的一天带来新的希望，适合规划与开始执行。",
        "大吉": "充满活力的开始，适合推进重要项目和计划。"
    },
    "卯时 (7-9点)": {
        "大凶": "注意沟通可能出现的问题，避免误会。",
        "凶": "小心处理人际关系和工作任务。",
        "平": "保持专注，一切按计划顺利进行。",
        "吉": "良好的运势，适合开展工作和商业活动。",
        "大吉": "非常顺利，新的机遇可能出现。"
    },
    "辰时 (9-11点)": {
        "大凶": "警惕潜在的困难，避免投资和重要决策。",
        "凶": "面临挑战，需要耐心和策略。",
        "平": "工作逐步推进，保持耐心。",
        "吉": "适合团队合作，可望取得进展。",
        "大吉": "成果显现，适合完成任务，获得认可。"
    },
    "巳时 (11-13点)": {
        "大凶": "中午时分注意健康和饮食，避免过度劳累。",
        "凶": "可能遇到中午的疲惫或消极情绪。",
        "平": "平稳过渡到午后，适合休息和充电。",
        "吉": "能量回升，准备下午的工作。",
        "大吉": "中午时间点吉星高照，好消息可能到来。"
    },
    "午时 (13-15点)": {
        "大凶": "注意午后可能的低效或误判。",
        "凶": "可能感到午后的懈怠，需找寻动力。",
        "平": "继续保持稳定的工作节奏。",
        "吉": "状态回升，适合处理重要事务。",
        "大吉": "午后运势良好，是创新和实施计划的好时机。"
    },
    "未时 (15-17点)": {
        "大凶": "避免在这个时段做出冲动的决定。",
        "凶": "小心翼翼，避免下午的误会或财务损失。",
        "平": "一天中平稳时段，适合总结与计划。",
        "吉": "下午末尾，事务有望顺利完成。",
        "大吉": "日近黄昏，好运连连，可能收到好消息。"
    },
    "申时 (17-19点)": {
        "大凶": "小心处理下班后的活动，避免不必要的麻烦。",
        "凶": "留意人际关系，可能的误解需及时澄清。",
        "平": "收工时间，适合放松和为晚上计划。",
        "吉": "工作日结束带来轻松气氛，适合社交。",
        "大吉": "夜幕降临前的时刻，适合庆祝和享受成果。"
    },
    "酉时 (19-21点)": {
        "大凶": "晚上时分注意安全和健康。",
        "凶": "可能遇到不愉快的社交场合，选择适当退出。",
        "平": "适合家庭时间，和亲朋好友放松交流。",
        "吉": "良好的社交时刻，可能有有益的交流。",
        "大吉": "夜晚运势上升，适合文化和艺术活动。"
    },
    "戌时 (21-23点)": {
        "大凶": "避免夜晚重要决策，注意休息。",
        "凶": "可能感到孤独或焦虑，需要放松心情。",
        "平": "平静的夜晚，适合阅读和计划第二天。",
        "吉": "心情放松，有利于创意和灵感。",
        "大吉": "夜深人静，是深度思考和灵魂对话的时刻。"
    },
    "亥时 (23-1点)": {
        "大凶": "深夜需保持警觉，避免不安和不必要的忧虑。",
        "凶": "可能因思虑过多而难以入眠，需要寻求平静。",
        "平": "夜深人静，是休息和充电的好时机。",
        "吉": "利于反思和自我修养，计划未来。",
        "大吉": "深夜的宁静带来内心的和平，可能有重要的洞察和启示。"
    }
}


health_summary = {
    "大凶": "健康状况可能面临重大风险，需要格外注意。建议定期做健康检查，关注慢性病的预防和治疗。",
    "凶": "可能会遇到一些健康问题，注意饮食和休息，避免过度劳累。",
    "平": "整体健康状况平稳，继续保持良好的生活习惯，定期体检。",
    "吉": "健康状况良好，通过积极的生活方式可进一步增强体质。",
    "大吉": "健康状况非常好，保持当前的健康管理方式，可享有长久的良好健康。"
}

health_yun = {
    "大凶": "这十年里，健康可能是最需要关注的问题，重视任何小病小痛，及时治疗，避免演变成大问题。",
    "凶": "在这十年期间，可能会遇到一些健康挑战，注意调整生活习惯，提高免疫力。",
    "平": "这十年的健康状况总体稳定，维持健康的生活习惯和定期体检是关键。",
    "吉": "健康状态良好，可通过适量运动和合理饮食进一步提升健康水平。",
    "大吉": "十年大运期间，健康状况极佳，应继续保持，并可尝试更多健康促进活动，如冥想、瑜伽等。"
}

health_year = {
    "大凶": "今年可能会遇到较为严重的健康问题，需要特别注意。建议增加体检频率，关注身体的任何异常信号。",
    "凶": "今年的健康状况可能会有些波动，注意预防季节性疾病，避免过度劳累，确保充足睡眠。",
    "平": "今年健康状况总体平稳，维护平衡的生活习惯，定期进行基本的体检。",
    "吉": "今年健康状态良好，可以通过合理饮食和适度运动来进一步提升。",
    "大吉": "今年享有非常好的健康运，保持积极的生活态度和良好习惯，进一步增强体质。"
}


health_month = {
    "1月": {
        "大凶": "注意防寒保暖，避免因寒冷引起的健康问题。",
        "凶": "可能因季节变化导致的小病小痛，注意增强免疫力。",
        "平": "维持健康的生活方式，保持稳定的健康状况。",
        "吉": "新的一年开始，有利于制定健康计划，提升体质。",
        "大吉": "充满活力，是进行体育活动和户外运动的好时机。"
    },
    "2月": {
        "大凶": "小心流感和其他季节性疾病，积极预防。",
        "凶": "可能感到疲劳或有轻微健康不适，注意休息。",
        "平": "保持良好的饮食和运动习惯，维护身体健康。",
        "吉": "身体状况良好，可以尝试新的健康活动或饮食计划。",
        "大吉": "极佳的体能状态，适合挑战自我，达成健康目标。"
    },
    "3月": {
        "大凶": "随着季节变化，小心过敏或其他季节性问题。",
        "凶": "可能由于过渡季节感到身体不适，适当调整。",
        "平": "随着春天到来，适当增加户外活动，促进身体健康。",
        "吉": "好转的气候增加了户外活动的机会，利于健康。",
        "大吉": "春暖花开，是做出积极健康改变的绝佳时期。"
    },
    "4月": {
        "大凶": "警惕春季常见疾病，如过敏等，采取预防措施。",
        "凶": "可能会因季节变化出现一些小病痛，注意身体变化。",
        "平": "总体健康状况平稳，继续保持健康的饮食和运动。",
        "吉": "身体状况向好，春天是增强体质的好机会。",
        "大吉": "精力充沛，适合尝试新的运动或健身计划。"
    },
     "5月": {
        "大凶": "注意春末夏初的健康转变，可能易受疲劳和过敏影响。",
        "凶": "身体可能因季节更替感到不适，适度调整饮食和作息。",
        "平": "温和的天气有助于维持稳定的健康状况，继续保持良好习惯。",
        "吉": "气温升高，增加户外活动有利于身心健康。",
        "大吉": "充满活力的好月份，适合开展新的健康和健身计划。"
    },
    "6月": {
        "大凶": "夏季炎热，注意防暑降温，避免中暑。",
        "凶": "可能因高温天气引起的健康问题，注意水分补充。",
        "平": "适应了夏季天气，通过适当活动保持身体健康。",
        "吉": "夏日热力，适合水上活动，增强体质。",
        "大吉": "能量满满，夏日活动带来健康益处和快乐。"
    },
    "7月": {
        "大凶": "持续高温，极需注意防暑和避免长时间户外活动。",
        "凶": "夏季常见疾病可能上升，保持个人卫生，预防食物中毒。",
        "平": "天气炎热，但通过合理安排，可保持健康稳定。",
        "吉": "夏季的旺盛生命力促进健康，注意平衡休息和活动。",
        "大吉": "高昂的精神状态和良好的体能，享受夏日时光。"
    },
    "8月": {
        "大凶": "注意避免中暑和夏季疾病，尤其是老人和小孩。",
        "凶": "仍需关注夏季健康问题，如热伤风和消化不良。",
        "平": "身体开始适应夏季高温，继续保持健康习惯。",
        "吉": "夏末凉风开始，适合户外运动，提升身体素质。",
        "大吉": "随着夏季结束，体验健康生活的乐趣，准备迎接秋季。"
    },
    "9月": {
        "大凶": "季节变换，注意身体适应问题，防范感冒。",
        "凶": "可能因季节更换而感到身体不适，适当增减衣物。",
        "平": "气候宜人，通过适度运动保持良好的健康状况。",
        "吉": "秋高气爽，适合加强体育锻炼，增强体质。",
        "大吉": "秋季带来清新空气和丰富水果，大幅提升健康水平。"
    },
    "10月": {
        "大凶": "秋季转凉，注意保暖，防止感冒和呼吸系统疾病。",
        "凶": "随着天气变冷，可能需要注意皮肤和呼吸道健康。",
        "平": "秋冷清晨，保持适当运动和健康饮食，维持稳定健康。",
        "吉": "秋天是收获的季节，适合养生和调整体质。",
        "大吉": "良好的气候和充足的营养，为身体带来积极影响。"
    },
    "11月": {
        "大凶": "初冬易感冒，注意增强免疫力，避免冷风侵袭。",
        "凶": "气温下降，可能对关节和老年人的健康造成影响。",
        "平": "天气逐渐转冷，及时增减衣物，保持身体舒适。",
        "吉": "冬季到来前的准备，通过锻炼和合理饮食增强体质。",
        "大吉": "适应了冬季的来临，通过积极生活方式保持高水平的健康状况。"
    },
    "12月": {
        "大凶": "冬季来临，注意防范寒冷引起的疾病，如感冒。",
        "凶": "由于天气寒冷，可能增加心血管疾病的风险，注意保暖。",
        "平": "保持良好的生活习惯，应对寒冷天气带来的挑战。",
        "吉": "适当的户外运动会帮助增强身体抵抗力，提升健康。",
        "大吉": "在年末保持了良好的健康状态，为新一年的健康打下良好基础。"
    }
}

health_day = {
    "大凶": "今天可能会遇到重大的健康问题，需要格外注意。避免高风险活动，关注任何身体不适的信号，必要时寻求医疗帮助。",
    "凶": "今天可能会有小的健康不适，注意休息和适当的营养补充。避免过劳和精神紧张，保持良好的休息。",
    "平": "今天的健康状况一般，没有太大波动。继续保持健康的生活方式，包括适度运动和均衡饮食。",
    "吉": "今天的身体状况较好，可以考虑增加运动量或尝试新的健康活动。保持积极的心态对身心都有好处。",
    "大吉": "今天拥有极佳的健康运，适合进行体能要求较高的活动。保持这一状态，继续关注健康，尝试新的健康饮食或运动计划。"
}


health_hour = {
    "子时 (1-3点)": {
        "大凶": "深夜应避免剧烈运动，注意休息，预防失眠。",
        "凶": "可能因熬夜导致免疫力下降，注意不要过度劳累。",
        "平": "适合安静休息，为身体充电。",
        "吉": "深夜静修有助于心灵平和，对心理健康有益。",
        "大吉": "适合进行轻柔活动如冥想，促进睡眠质量。"
    },
    "丑时 (3-5点)": {
        "大凶": "极需注意睡眠质量，避免因失眠影响第二天的健康状态。",
        "凶": "可能出现轻微睡眠障碍，尝试放松心情，避免过度思考。",
        "平": "保持良好的睡眠习惯，准备迎接新的一天。",
        "吉": "早晨醒来后，进行简单拉伸，唤醒身体。",
        "大吉": "睡眠充足，精力充沛，为健康的一天做好准备。"
    },
    "寅时 (5-7点)": {
        "大凶": "警惕早晨起床后可能的低血压状况，起床动作要缓慢。",
        "凶": "可能因早起而感到疲惫，注意不要立即进行剧烈运动。",
        "平": "适合做一些轻松的早操，唤醒身体。",
        "吉": "新的一天开始，适合外出呼吸新鲜空气，增强体质。",
        "大吉": "早晨状态极佳，适合进行较为强度的运动，提升健康水平。"
    },
    "卯时 (7-9点)": {
        "大凶": "早餐需要注意健康搭配，避免油腻重口味，预防消化不良。",
        "凶": "小心早餐可能导致的过敏反应，选择清淡易消化食物。",
        "平": "享受营养均衡的早餐，为一天的工作学习提供能量。",
        "吉": "早上精神饱满，适合进行脑力或体力活动，保持活力。",
        "大吉": "健康状态优秀，适合挑战高难度的任务或训练。"
    },
    "辰时 (9-11点)": {
        "大凶": "工作学习高峰期，注意劳逸结合，预防颈椎病和眼疲劳。",
        "凶": "可能因长时间的精神集中导致头痛，适时休息。",
        "平": "保持正常工作节奏，适当活动身体，缓解压力。",
        "吉": "工作效率高，身体状态良好，可以承担更多任务。",
        "大吉": "精力充沛，工作学习表现出色，身心健康状态佳。"
    },
    "巳时 (11-13点)": {
        "大凶": "午餐要注意健康，避免过量摄入高热量食物，预防肥胖。",
        "凶": "可能因午餐不当导致消化不良，选择易消化食物。",
        "平": "享用健康午餐，为下午的工作学习补充能量。",
        "吉": "午后体力恢复良好，适合进行一些轻松的身体活动。",
        "大吉": "精神状态好，身体充满活力，适合从事高强度工作。"
    },
        "午时 (13-15点)": {
        "大凶": "避免在高温下长时间活动，预防中暑。",
        "凶": "可能因午后疲劳感显著，注意休息调整。",
        "平": "保持身体水分，维持正常工作和学习节奏。",
        "吉": "精神状态良好，适合完成重要任务。",
        "大吉": "能量充沛，是进行身体锻炼的好时机。"
    },
    "未时 (15-17点)": {
        "大凶": "警惕因过度劳累引起的健康问题。",
        "凶": "小心办公室综合症，定时做眼保健操和身体拉伸。",
        "平": "下午茶时光，适合轻松一刻，调节心情。",
        "吉": "工作效率提升，身体状况良好。",
        "大吉": "精力旺盛，是完成任务或进行体育活动的最佳时刻。"
    },
    "申时 (17-19点)": {
        "大凶": "下班高峰期，注意交通安全和预防意外伤害。",
        "凶": "可能因为下班后的忙碌而感到疲惫，注意适当放松。",
        "平": "适合进行晚餐和休闲活动，平衡工作与生活。",
        "吉": "身心状态良好，适合家庭聚会或小范围社交。",
        "大吉": "精神充沛，适合参加健身房锻炼或户外运动。"
    },
    "酉时 (19-21点)": {
        "大凶": "小心晚餐过量或饮食不当导致的健康问题。",
        "凶": "可能因晚上工作或学习压力增大感到焦虑。",
        "平": "享受宁静的晚餐时光，准备进入休息状态。",
        "吉": "情绪稳定，是进行文化或艺术活动的好时机。",
        "大吉": "心情愉悦，身体状态极佳，适合进行心灵和身体的双重放松。"
    },
    "戌时 (21-23点)": {
        "大凶": "避免晚上过度思考工作或生活问题，以免影响睡眠。",
        "凶": "可能会感到紧张或焦虑，需要通过阅读或听音乐放松心情。",
        "平": "保持平和心态，准备进入良好睡眠。",
        "吉": "心情放松，是进行夜间休闲活动的好时机。",
        "大吉": "完美结束一天，睡前冥想或瑜伽有助于提高睡眠质量。"
    },
    "亥时 (23-1点)": {
        "大凶": "警惕失眠或睡眠质量差，尽量保持睡前宁静。",
        "凶": "可能因为睡前使用电子设备过多而影响睡眠。",
        "平": "维持规律的睡眠时间，避免熬夜。",
        "吉": "良好的睡眠习惯带来优质睡眠。",
        "大吉": "深夜的平静带来深度休息，次日醒来精力充沛。"
    }
}


family_fortune = {
    "大凶": "可能面临家庭成员健康严重问题，或遭遇分裂风险，如离婚，需要增强家庭凝聚力。",
    "凶": "家庭成员可能经历健康小状况，或关系微妙变化，注意沟通，防止关系恶化。",
    "平": "家庭关系保持一般平稳，继续维持日常的关怀和支持。",
    "吉": "家庭成员间关系得到加强，可能有结婚、生子等喜事，或亲属健康好转。",
    "大吉": "家庭和谐幸福，大事小情皆顺心，可能迎来多个家庭喜事，如婚礼、新生儿。"
}

family_yun = {
    "大凶": "这十年可能是家庭关系试炼期，面临健康危机或分离的风险，关键在于加强沟通与理解。",
    "凶": "偶尔会有家庭成员健康问题或关系小磕碰，及时处理是保持和谐的关键。",
    "平": "家庭关系总体平稳，但需留意维护，防止日常小矛盾累积。",
    "吉": "家庭关系和睦，期间可能有成员结婚、生子，或是关系显著改善，健康状况向好。",
    "大吉": "家庭氛围非常融洽，十年间可能迎来多次喜庆，成员间支持和爱护彼此。"
}

family_year = {
    "大凶": "今年可能面对家庭重大危机，如严重的健康问题，或关系破裂，需要全家人的共同努力。",
    "凶": "家庭成员可能遭遇健康挑战或感情冷淡，重视家人感受，及时沟通解决。",
    "平": "家庭生活相对平静，小矛盾可能出现，但可通过日常的关心与沟通化解。",
    "吉": "家庭关系温馨，可能有喜庆事项如婚礼或家庭成员健康改善，增加家庭幸福感。",
    "大吉": "家庭和睦，一年中可能迎来多个喜事，如家庭成员结婚、生子，家庭氛围愉悦。"
}

family_month = {
    "大凶": "本月可能面临家庭中的重大挑战，如亲属健康危机或重要关系的考验，需要家庭成员间的紧密合作。",
    "凶": "可能遇到家庭成员之间的小冲突或健康小问题，及时沟通与理解对方是解决问题的关键。",
    "平": "家庭关系平稳，继续保持开放的沟通和相互支持，处理日常小矛盾。",
    "吉": "家庭氛围和谐，可能有利于家庭成员之间的关系改善，或庆祝家庭成员的健康、成就。",
    "大吉": "本月家庭和谐，可能迎来家庭喜事，如婚礼、庆生或家庭聚会，增强家庭纽带。"
}

family_day = {
    "大凶": "今天可能遇到家庭关系的严峻考验，如亲人间的误解或争执，需谨慎处理，避免冲动。",
    "凶": "家庭中可能出现小的矛盾或不和，需要耐心沟通，尽量避免激化矛盾。",
    "平": "家庭生活较为平常，维护正常的交流和关怀，保持家庭平稳。",
    "吉": "今天家庭气氛较为融洽，适合加强家庭成员间的联系，分享彼此的喜悦和成就。",
    "大吉": "家庭中充满了欢笑和喜悦，可能有特别的家庭活动或庆祝，加深了家庭成员之间的感情。"
}

ys_summary={
"木":"",
"火":"",
"土":"",
"金":"",
"水":"",
"甲":"",
"乙":"",
"丙":"",
"丁":"",
"戊":"",
"己":"",
"庚":"",
"辛":"",
"壬":"",
"癸":"",
"子":"",
"丑":"",
"寅":"",
"卯":"",
"辰":"",
"巳":"",
"午":"",
"未":"",
"申":"",
"酉":"",
"戌":"",
"亥":""
}


js_summary={
"木":"",
"火":"",
"土":"",
"金":"",
"水":"",
"甲":"",
"乙":"",
"丙":"",
"丁":"",
"戊":"",
"己":"",
"庚":"",
"辛":"",
"壬":"",
"癸":"",
"子":"",
"丑":"",
"寅":"",
"卯":"",
"辰":"",
"巳":"",
"午":"",
"未":"",
"申":"",
"酉":"",
"戌":"",
"亥":"",
}

ys_text={
"木":"",
"火":"",
"土":"",
"金":"",
"水":"",
"甲":"",
"乙":"",
"丙":"",
"丁":"",
"戊":"",
"己":"",
"庚":"",
"辛":"",
"壬":"",
"癸":"",
"子":"",
"丑":"",
"寅":"",
"卯":"",
"辰":"",
"巳":"",
"午":"",
"未":"",
"申":"",
"酉":"",
"戌":"",
"亥":""
}

js_text={
"木":"",
"火":"",
"土":"",
"金":"",
"水":"",
"甲":"",
"乙":"",
"丙":"",
"丁":"",
"戊":"",
"己":"",
"庚":"",
"辛":"",
"壬":"",
"癸":"",
"子":"",
"丑":"",
"寅":"",
"卯":"",
"辰":"",
"巳":"",
"午":"",
"未":"",
"申":"",
"酉":"",
"戌":"",
"亥":""
}


ys_pic={
"木":"",
"火":"",
"土":"",
"金":"",
"水":"",
"甲":"",
"乙":"",
"丙":"",
"丁":"",
"戊":"",
"己":"",
"庚":"",
"辛":"",
"壬":"",
"癸":"",
"子":"",
"丑":"",
"寅":"",
"卯":"",
"辰":"",
"巳":"",
"午":"",
"未":"",
"申":"",
"酉":"",
"戌":"",
"亥":""
}

js_pic={
"木":"",
"火":"",
"土":"",
"金":"",
"水":"",
"甲":"",
"乙":"",
"丙":"",
"丁":"",
"戊":"",
"己":"",
"庚":"",
"辛":"",
"壬":"",
"癸":"",
"子":"",
"丑":"",
"寅":"",
"卯":"",
"辰":"",
"巳":"",
"午":"",
"未":"",
"申":"",
"酉":"",
"戌":"",
"亥":""
}

ys_music={
"木":"",
"火":"",
"土":"",
"金":"",
"水":"",
"甲":"",
"乙":"",
"丙":"",
"丁":"",
"戊":"",
"己":"",
"庚":"",
"辛":"",
"壬":"",
"癸":"",
"子":"",
"丑":"",
"寅":"",
"卯":"",
"辰":"",
"巳":"",
"午":"",
"未":"",
"申":"",
"酉":"",
"戌":"",
"亥":""
}

js_music={
"木":"",
"火":"",
"土":"",
"金":"",
"水":"",
"甲":"",
"乙":"",
"丙":"",
"丁":"",
"戊":"",
"己":"",
"庚":"",
"辛":"",
"壬":"",
"癸":"",
"子":"",
"丑":"",
"寅":"",
"卯":"",
"辰":"",
"巳":"",
"午":"",
"未":"",
"申":"",
"酉":"",
"戌":"",
"亥":""
}

shisheng={
"财": "财运事业相关，父亲相关，妻子相关",
"才": "财运事业相关，父亲相关，妻子相关",
"比": "财运事业相关，母亲相关，兄弟相关",
"劫": "财运事业相关，母亲相关，兄弟相关",
"食": "财运事业相关，健康相关，女命女儿，母亲",
"伤": "财运事业相关，女命儿子，母亲",
"印": "学习运事业相关，父亲",
"枭": "学习运事业相关，父亲",
"官": "事业相关，男命女儿,父亲",  
"杀": "事业相关，男命儿子,父亲"
}