{
  "id": "lotus-sutra",
  "title": "妙法莲华经",
  "subtitle": "法华经",
  "description": "如是我闻，一时佛住王舍城耆阇崛山中，与大比丘众万二千人俱。",
  "difficulty": "advanced",
  "duration": 120,
  "benefits": ["究竟解脱", "普度众生", "成就佛道"],
  "content": {
    "fullText": [
      "如是我闻，一时佛住王舍城耆阇崛山中，与大比丘众万二千人俱。",
      "尔时世尊四众围绕，供养恭敬尊重赞叹。为诸菩萨说大乘经，名无量义教菩萨法佛所护念。",
      "佛说此经已，结跏趺坐，入于无量义处三昧，身心不动。是时天雨曼陀罗华、摩诃曼陀罗华、曼殊沙华、摩诃曼殊沙华，而散佛上及诸大众。",
      "普佛世界，六种震动。尔时会中，比丘、比丘尼、优婆塞、优婆夷、天龙、夜叉、乾闼婆、阿修罗、迦楼罗、紧那罗、摩睺罗伽、人非人，及诸小王、转轮圣王，是诸大众，得未曾有，欢喜合掌，一心观佛。",
      "尔时佛放眉间白毫相光，照东方万八千世界，靡不周遍，下至阿鼻地狱，上至阿迦尼吒天。于此世界，尽见彼土六趣众生，又见彼土现在诸佛，及闻诸佛所说经法，并见彼诸比丘、比丘尼、优婆塞、优婆夷，诸修行得道者。",
      "复见诸菩萨摩诃萨，种种因缘、种种信解、种种相貌，行菩萨道。复见诸佛般涅槃者。复见诸佛般涅槃后，以佛舍利起七宝塔。",
      "尔时弥勒菩萨作是念：今者、世尊现神变相，以何因缘而有此瑞？今佛世尊入于三昧，是不可思议、现希有事，当以问谁？谁能答者？",
      "复作此念：是文殊师利法王之子，已曾亲近供养过去无量诸佛，必应见此希有之相，我今当问。",
      "尔时比丘、比丘尼、优婆塞、优婆夷，及诸天龙、鬼神等，咸作此念：是佛光明神通之相，今当问谁？",
      "尔时弥勒菩萨，欲自决疑，又观四众比丘、比丘尼、优婆塞、优婆夷，及诸天龙、鬼神、等众会之心，而问文殊师利言：以何因缘，而有此瑞神通之相，放大光明，照于东方万八千土，悉见彼佛国界庄严？",
      "于是弥勒菩萨欲重宣此义，以偈问曰：",
      "文殊师利，导师何故、眉间白毫，大光普照。",
      "雨曼陀罗、曼殊沙华，栴檀香风，悦可众心。",
      "以是因缘，地皆严净，而此世界、六种震动。",
      "时四部众、咸皆欢喜，身意快然，得未曾有。",
      "眉间光明，照于东方，万八千土，皆如金色，",
      "从阿鼻狱、上至有顶。诸世界中，六道众生，",
      "生死所趣、善恶业缘、受报好丑，于此悉见。",
      "又睹诸佛、圣主师子、演说经典，微妙第一。",
      "其声清净，出柔软音，教诸菩萨、无数亿万，",
      "梵音深妙，令人乐闻。各于世界，讲说正法、",
      "种种因缘、以无量喻、照明佛法、开悟众生。",
      "若人遭苦，厌老病死，为说涅槃，尽诸苦际。",
      "若人有福，曾供养佛，志求胜法，为说缘觉。",
      "若有佛子，心净柔软，乐深利智，为说菩萨。",
      "文殊师利，我住于此，见闻若斯，及千亿事，",
      "如是众多，今当略说。我见彼土，恒沙菩萨，",
      "种种因缘、而求佛道。或有行施，金银珊瑚、",
      "真珠摩尼、砗磲玛瑙、金刚诸珍，奴婢车乘、",
      "宝饰辇舆，欢喜布施。回向佛道，愿得是乘，",
      "三界第一，诸佛所叹。或有菩萨，驷马宝车、",
      "栏楯华盖、轩饰布施。复见菩萨，身肉手足、",
      "及妻子施，与求佛道。又见菩萨，头目身体、",
      "欣乐施与，求佛智慧。文殊师利，我见诸王，",
      "往诣佛所、问无上道，便舍乐土、宫殿臣妾，",
      "剃除须发、而被法服。或见菩萨，而作比丘，",
      "独处闲静，乐诵经典。又见菩萨，勇猛精进，",
      "入于深山，思惟佛道。又见离欲，常处空闲，",
      "深修禅定，得五神通。又见菩萨，安禅合掌，",
      "以千万偈、赞诸法王。复见菩萨，智深志固，",
      "能问诸佛，闻悉受持。又见佛子，定慧具足，",
      "以无量喻、为众讲法，欣乐说法、化诸菩萨，",
      "破魔兵众、而击法鼓。又见菩萨，寂然宴默，",
      "天龙恭敬，不以为喜。又见菩萨，处林放光，",
      "济地狱苦，令入佛道。又见佛子，未尝睡眠，",
      "经行林中，勤求佛道。又见具戒，威仪无缺，",
      "净如宝珠，以求佛道。又见佛子，住忍辱力，",
      "增上慢人，恶骂捶打，皆悉能忍，以求佛道。",
      "又见菩萨，离诸戏笑、及痴眷属，亲近智者，",
      "一心除乱，摄念山林、亿千万岁，以求佛道。",
      "或见菩萨，肴膳饮食、百种汤药、施佛及僧。",
      "名衣上服、价直千万，或无价衣、施佛及僧。",
      "千万亿种、栴檀宝舍、众妙卧具、施佛及僧。",
      "清净园林、华果茂盛、流泉浴池、施佛及僧。",
      "如是等施、种果微妙，欢喜无厌，求无上道。",
      "或有菩萨，说寂灭法，种种教诏，无数众生。",
      "或见菩萨，观诸法性、无有二相，犹如虚空。",
      "又见佛子，心无所著，以此妙慧、求无上道。",
      "文殊师利，又有菩萨，佛灭度后，供养舍利。",
      "又见佛子，造诸塔庙、无数恒沙，严饰国界，",
      "宝塔高妙、五千由旬，纵广正等、二千由旬。",
      "一一塔庙、各千幢幡，珠交露幔，宝铃和鸣。",
      "诸天龙神、人及非人，香华伎乐，常以供养。",
      "文殊师利，诸佛子等，为供舍利，严饰塔庙，",
      "国界自然、殊特妙好，如天树王、其华开敷，",
      "佛放一光、我及众会，见此国界、种种殊妙，",
      "诸天龙王、人非人等，恭敬合掌，礼释迦文。",
      "佛说偈已，告文殊师利：我今于此、大众中说，",
      "我本行菩萨道、所经寿命，今犹未尽，复倍上数。",
      "然今非实灭度，而便唱言、当取灭度，如来以是方便、教化众生。",
      "所以者何。若佛久住于世，薄德之人，不种善根，",
      "贫穷下贱，贪著五欲，入于忆想妄见网中，若见如来常在不灭，",
      "便起憍恣、而怀厌怠，不能生难遭之想、恭敬之心，",
      "是故如来以方便说：比丘当知，诸佛出世，难可值遇。",
      "所以者何。诸薄德人，过无量百千万亿劫，或有见佛，",
      "或不见者，以此事故，我作是言：诸比丘，如来难可得见。",
      "斯众生等、闻如是语，必当生于难遭之想，心怀恋慕，",
      "渴仰于佛，便种善根，是故如来虽不实灭，而言灭度。",
      "又善男子、诸佛如来、法皆如是，为度众生，皆实不虚。",
      "譬如良医、智慧聪达，明练方药，善治众病。",
      "其人多诸子息、若十、二十、乃至百数，以有事缘、远至余国。",
      "诸子于后、饮他毒药，药发闷乱，宛转于地。",
      "是时其父、还来归家，诸子饮毒，或失本心、或不失者，",
      "遥见其父，皆大欢喜，拜跪问讯、善安隐归：我等愚痴，",
      "误服毒药，愿见救疗，更赐寿命。",
      "父见子等苦恼如是，依诸经方、求好药草，色香美味、",
      "皆悉具足，捣筛和合，与子令服，而作是言：此大良药，",
      "色香美味、皆悉具足，汝等可服，速除苦恼，无复众患。",
      "其诸子中、不失心者，见此良药、色香俱好，即便服之，",
      "病尽除愈。余失心者，见其父来，虽亦欢喜问讯、求索治病，",
      "然与其药、而不肯服。所以者何。毒气深入，失本心故，",
      "于此好色香药、而谓不美。",
      "父作是念：此子可愍，为毒所中，心皆颠倒，",
      "虽见我喜，求索救疗，如是好药、而不肯服，我今当设方便、令服此药。",
      "即作是言：汝等当知，我今衰老，死时已到，是好良药、今留在此，",
      "汝可取服，勿忧不差。作是教已，复至他国，遣使还告：汝父已死。",
      "是时诸子闻父背丧，心大忧恼而作是念：若父在者，慈愍我等，",
      "能见救护，今者舍我远丧他国，自惟孤露，无复恃怙。",
      "常怀悲感，心遂醒悟，乃知此药色香美味。即取服之，毒病皆愈。",
      "其父闻子悉已得差，寻便来归，咸使见之。",
      "诸善男子，于意云何，颇有人能说此良医虚妄罪不？",
      "不也，世尊。佛言：我亦如是，成佛已来、无量无边百千万亿那由他阿僧祇劫，",
      "为众生故，以方便力、言当灭度，亦无有能如法说我虚妄过者。",
      "尔时世尊欲重宣此义，而说偈言：",
      "自我得佛来，所经诸劫数，无量百千万、亿载阿僧祇，",
      "常说法教化，无数亿众生，令入于佛道。尔来无量劫，",
      "为度众生故，方便现涅槃、而实不灭度，常住此说法。",
      "我常住于此，以诸神通力，令颠倒众生、虽近而不见。",
      "众见我灭度，广供养舍利，咸皆怀恋慕、而生渴仰心。",
      "众生既信伏，质直意柔软，一心欲见佛，不自惜身命。",
      "时我及众僧、俱出灵鹫山，我时语众生，常在此不灭，",
      "以方便力故，现有灭不灭，余国有众生、恭敬信乐者，",
      "我复为彼说，无上法，汝等不闻此，但谓我灭度。",
      "我见诸众生，没在于苦恼，故不为现身，令其生渴仰，",
      "因其心恋慕，乃出为说法。神通力如是，于阿僧祇劫，",
      "常在灵鹫山、及余诸住处，众生见劫尽、大火所烧时，",
      "我此土安隐，天人常充满，园林诸堂阁、种种宝庄严，",
      "宝树多华果，众生所游乐，诸天击天鼓，常作众伎乐，",
      "雨曼陀罗华，散佛及大众。我净土不毁，而众见烧尽，",
      "忧怖诸苦恼，如是悉充满。是诸罪众生，以恶业因缘，",
      "过阿僧祇劫，不闻三宝名。诸有修功德，柔和质直者，",
      "则皆见我身，在此而说法。或时为此众，说佛寿无量，",
      "久乃见佛者，为说佛难值。我智力如是，慧光照无量，",
      "寿命无数劫，久修业所得。汝等有智者，勿于此生疑，",
      "当断令永尽，佛语实不虚。如医善方便，为治狂子故，",
      "实在而言死，无能说虚妄。我亦为世父，救诸苦患者，",
      "为凡夫颠倒，实在而言灭。以常见我故，而生憍恣心，",
      "放逸著五欲，堕于恶道中。我常知众生，行道不行道，",
      "随所应可度，为说种种法。每自作是意，以何令众生、",
      "得入无上慧，速成就佛身。"
    ],
    "readingGuide": {
      "pace": "slow",
      "pauseBetweenParagraphs": 8,
      "highlightCurrentLine": true,
      "autoScroll": true
    }
  },
  "videoUrl": "https://ssswork.oss-cn-hangzhou.aliyuncs.com/jss/669_raw.mp4",
  "icon": "🪷",
  "color": "#FD79A8",
  "gradient": "linear-gradient(135deg, #FD79A8, #E84393)"
} 